:PROPERTIES:
:ID:       FC988BB7-0319-4E5A-BE2A-7A9BEDF6F0F5
:header-args: :results output
:END:
#+title: atlassian

Atlassian products seemingly remain pretty dominant.

I've never been particularly impressed...the solutions have always
seemed fairly meh. My impression is that Atlassian largely retains a
stranglehold due to the support for the products have for some
specific enterprise needs like controls (i.e., groups like IT keeping
a tight grip on the keys), which can also introduce further tension
with utility.

I've worked with Atlassian products in many orgs with different
configurations, but have yet to see one where there's evident value -
instead they all seem to drift towards a state where there's a very
regular need to chase down people with the appropriate
access/expertise and information like reporting data that is
ostensibly within the products still ends up getting tracked
elsewhere.

These therefore fall into the bucket of things that I wouldn't tend to
use personally (where for similar needs I tend to use things like
GitLab), but set myself up so I can develop some processes.

Atlassian provides ~acli~ as an interface for their services.

* Installation

https://developer.atlassian.com/cloud/acli/guides/install-acli/

** Homebrew

#+begin_src shell :session brew :async
  brew trust --formula atlassian/acli/acli
  brew tap atlassian/homebrew-acli
  brew install acli
#+end_src

** Verification

#+begin_src shell
  acli --version
#+end_src

#+RESULTS:
: acli version 1.3.19-stable

* Help

#+begin_src shell
  acli --help
#+end_src

#+RESULTS:
#+begin_example
Work seamlessly with Atlassian from the command line.

Usage:
  acli [command]

Available Commands
  admin       Admin commands.
  auth        Authenticate to use Atlassian CLI.
  confluence  Confluence Cloud commands.
  jira        Jira Cloud commands.
  rovodev     Atlassian’s AI coding agent: Rovo Dev (Beta).

Additional Commands:
  completion  Generate the autocompletion script for the specified shell
  config      Commands for changing configuration settings.
  feedback    Submit a request or report a problem.
  help        Help about any command

Flags:
  -h, --help      Show help for command
  -v, --version   version for acli

Use "acli [command] --help" for more information about a command.
#+end_example

* Jira

** Help

#+begin_src shell
  acli jira --help
#+end_src

#+RESULTS:
#+begin_example
Jira Cloud commands.

Usage:
  acli jira [command]

Available Commands:
  auth        Authenticate to use Atlassian CLI.
  board       Jira board commands.
  dashboard   Jira dashboard commands.
  field       Jira field commands.
  filter      Jira filter commands.
  project     Jira project commands.
  sprint      Jira sprint commands.
  workitem    Jira work item commands.

Flags:
  -h, --help   Show help for command

Use "acli jira [command] --help" for more information about a command.
#+end_example

** auth

*** Help

#+begin_src shell
  acli jira auth --help
#+end_src

#+RESULTS:
#+begin_example
Authenticate to use Atlassian CLI.

Usage:
  acli jira auth [command]

Available Commands:
  login       Authenticate with an Atlassian host.
  logout      Logout from account.
  status      Show account status.
  switch      Switch between accounts.

Flags:
  -h, --help   Show help for command

Use "acli jira auth [command] --help" for more information about a command.
#+end_example

*** login

**** Help

#+begin_src shell
  acli jira auth login --help
#+end_src

#+RESULTS:
#+begin_example
Authenticate with an Atlassian host.

Usage:
  acli jira auth login [flags]

Examples:
# Authenticate using web browser (OAuth)
$ acli jira auth login --web

# Authenticate with your email, site name and API token without scopes
$ acli jira auth login --site "mysite.atlassian.net" --email "user@atlassian.com" --token < token.txt
OR
$ echo <token> | acli jira auth login --site "mysite.atlassian.net" --email "user@atlassian.com" --token
	
# Authenticate with your email, site name and API token without scopes on Windows
$ Get-Content token.txt | .\acli.exe jira auth login --site "mysite.atlassian.net" --email "user@atlassian.com" --token

Flags:
  -e, --email string   User email is required for authentication
  -h, --help           Show help for command
  -s, --site string    Site of the Atlassian instance is required for authentication
      --token          Read token from standard input
  -w, --web            Authenticate using web browser
#+end_example

**** Token Login

I'll be looking to make use of the API token flow...first to store the credentials somewhere usable.

An API token can be created through the account settings in the Web UI.

All of the values can be thrown into environment variables and then just used by the shell.

#+begin_src shell
  echo ${ATLASSIAN_TOKEN} | acli jira auth login --site ${ATLASSIAN_SITE} --email ${ATLASSIAN_EMAIL} --token
#+end_src

#+RESULTS:
: [?25l[?2004h⣽ Authenticating...[D⣻ Authenticating...[D⢿ Authenticating...[D⡿ Authenticating...[D⣟ Authenticating...[D⣯ Authenticating...[D⣷ Authenticating...[D[2K[?2004l[?25h[?1002l[?1003l[?1006l✓ Authentication successful
:   Welcome, Matt Whipple

*** workitem

I think workitem is the subcommand that allows for getting directly to the issues and therefore
provides what amount to the primitives for command access so I'll start with that one.

**** Help

#+begin_src shell
  acli jira workitem --help
#+end_src

#+RESULTS:
#+begin_example
Jira work item commands.

Usage:
  acli jira workitem [command]

Available Commands:
  archive       Archives a work item or multiple work items.
  assign        Assign a work item(s) to an assignee(s).
  attachment    Work item attachments commands.
  clone         Create a duplicate work item(s).
  comment       Work item comments commands.
  create        Create a Jira work item.
  create-bulk   Bulk create Jira issues.
  delete        Delete a work item or multiple work items.
  edit          Edit a Jira work item or multiple work items.
  link          Link work items commands.
  list-watchers List watchers of an issue
  search        Searches for work item or multiple work items.
  transition    Transitioning a work item.
  unarchive     Unarchives work item or multiple work items.
  view          Retrieve information about Jira work items.
  watcher       Work item watcher commands.

Flags:
  -h, --help   Show help for command

Use "acli jira workitem [command] --help" for more information about a command.
#+end_example

* Confluence

** Help

#+begin_src shell
  acli confluence --help
#+end_src

#+RESULTS:
#+begin_example
Confluence Cloud commands.

Usage:
  acli confluence [command]

Available Commands:
  auth        Authenticate to use Atlassian CLI.
  blog        Confluence blog commands.
  page        Confluence page commands.
  space       Confluence space commands.

Flags:
  -h, --help   Show help for command

Use "acli confluence [command] --help" for more information about a command.
#+end_example

** auth

*** Help

#+begin_src shell
  acli confluence auth --help
#+end_src

#+RESULTS:
#+begin_example
Authenticate to use Atlassian CLI.

Usage:
  acli confluence auth [command]

Available Commands:
  login       Authenticate with an Atlassian host.
  logout      Logout from account.
  status      Show account status.
  switch      Switch between accounts.

Flags:
  -h, --help   Show help for command

Use "acli confluence auth [command] --help" for more information about a command.
#+end_example

*** Space

#+begin_src shell
  acli confluence space --help
#+end_src

#+RESULTS:
#+begin_example
Confluence space commands.

Usage:
  acli confluence space [command]

Available Commands:
  archive     Archive a Confluence space by key.
  create      Create a Confluence space.
  list        List Confluence spaces.
  restore     Restore a Confluence space from the trash or archive by key.
  update      Update details of a Confluence space, such as name, description, status, or settings by key.
  view        View details of a Confluence space.

Flags:
  -h, --help   Show help for command

Use "acli confluence space [command] --help" for more information about a command.
#+end_example
